EDT/УТ/src/InformationRegisters/ЗначенияДополнительныхПравПользователя/ЗначенияДополнительныхПравПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияДополнительныхПравПользователя</name>
  <comment>(Общ)</comment>
  <resources>
    <name>Значение</name>
    <comment>(Общ)</comment>
    <type>
      <types>Characteristic.ПраваПользователей</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ГруппыПользователей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Право</name>
    <comment>(Общ)</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.ПраваПользователей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/ЗначенияДополнительныхПравПользователя/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;

	Для каждого Запись Из ЭтотОбъект Цикл
		
		Если Запись.Значение <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		// приводим запись к нужному типу
		Запись.Значение = Запись.Право.ТипЗначения.ПривестиЗначение(Запись.Значение);

	КонецЦикла;

КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Перем ОбновлятьЗначениеГлПеременной;
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	КэшДополнительныхПрав = глЗначениеПеременной("ЗначенияДополнительныхПравПользователя");
	УправлениеПользователями.ИнформироватьОИзмененииНастроекПравАктивныхПользователей(ЭтотОбъект, 
																					  КэшДополнительныхПрав, 
																					  "Право",
																					  глЗначениеПеременной("глТекущийПользователь"), 
																					  "значения дополнительных прав",
																					  ОбновлятьЗначениеГлПеременной,
																					  Ложь);
																					  
	Если ОбновлятьЗначениеГлПеременной Тогда
		глЗначениеПеременнойУстановить("ЗначенияДополнительныхПравПользователя", КэшДополнительныхПрав, Истина);
	КонецЕсли;																						  

КонецПроцедуры
